{
  "backend/main.mo": "Main Motoko actor for the Supreme Trucking Group backend, defining data types (QuoteRequest, ShipmentRecord, ComplianceDocument, etc.) and storage maps, with blob storage mixin included and pre-populated resources content about FSMA 204 compliance.",
  "feature_evidence.json": "Feature evidence report confirming that the CareersPage scroll-to-top effect (using useEffect and window.scrollTo) is implemented in frontend/src/pages/CareersPage.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering components like Header, Hero, ContactForm, and pages like CareersPage, ResourcesPage, and PrivacyPolicyPage.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark mode theming, including colors for background, foreground, primary, sidebar, and chart variables.",
  "frontend/index.html": "Root HTML file for the React app, setting up the viewport, page title ('Supreme Trucking Group Website'), and mounting point for the React application.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for home, privacy policy, resources, and careers pages, wrapped in QueryClientProvider and a Toaster notification component.",
  "frontend/src/components/About.tsx": "About Us section component displaying a reefer truck image and four service highlights (OTR, local delivery, team driving, temperature-controlled transport) with checkmark icons.",
  "frontend/src/components/ContactForm.tsx": "Contact and quote request form component with react-hook-form validation, backend mutation via actor, success/error toast notifications, and company contact info including address and phone number.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with company info, contact details, and quick navigation links that scroll to page sections or navigate to routes. Includes a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with logo, desktop nav links, and a mobile hamburger menu. Handles smooth scrolling to page sections and navigation to /resources and /careers routes.",
  "frontend/src/components/Hero.tsx": "Full-width hero section with a headline, CTA buttons for quote requests and smooth scrolling, and three feature cards highlighting fleet size, 24/7 service, and nationwide coverage.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with a shared Header and Footer, rendering child routes via TanStack Router's Outlet.",
  "frontend/src/components/Services.tsx": "Displays a grid of four service cards (OTR, local delivery, team driving, refrigerated transport) and a promotional banner with fleet stats and a fleet image.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using TanStack Query, returning an anonymous or authenticated actor based on the current Internet Identity. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exports TanStack Query hooks for fetching form submissions, privacy policy, and resources content from the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for light and dark themes using OKLCH color values, including colors for background, foreground, primary, sidebar, and chart elements.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for React Query and InternetIdentityProvider for authentication context wrapping the root App component.",
  "frontend/src/pages/CareersPage.tsx": "Careers page component displaying a Class A CDL Team Driver OTR job posting with pay structure, mileage guarantee, requirements, and contact info, along with injected schema.org JobPosting JSON-LD structured data for SEO.",
  "frontend/src/pages/HomePage.tsx": "Home page component that composes the Hero, About, Services, and ContactForm section components into a single page layout.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Privacy policy page that fetches and renders policy content from a backend query, showing loading skeletons and error alerts as needed, plus a static SMS Communication Notice section.",
  "frontend/src/pages/ResourcesPage.tsx": "Resources page that fetches and displays content from a backend query, processing a special bracket-delimited pattern to render an internal quote-request hyperlink within the content.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, defines custom border radii, accordion keyframe animations, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking version, known issues, and a list of existing implemented features with their requirement IDs and descriptions for build planning continuity."
}