{
  "backend/main.mo": "Main Motoko actor for the Supreme Trucking Group backend, defining data types (QuoteRequest, ShipmentRecord, ComplianceDocument, etc.) and storage maps, with blob storage mixin included and pre-populated resources content about FSMA 204 compliance.",
  "feature_evidence.json": "Feature evidence report documenting a single high-confidence fix: correcting the Careers navigation link in Header.tsx to properly navigate to the /careers route in both desktop and mobile menus.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to one-sentence summaries describing the purpose and key details of each component, page, hook, and style file in the project.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for the design system's color tokens in both light and dark modes, including background, foreground, primary, and chart colors.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app into a #root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for home, privacy policy, resources, and careers pages inside a QueryClientProvider with a Sonner toast notifier.",
  "frontend/src/components/About.tsx": "About Us section component displaying a reefer truck image, company description paragraphs, and four service highlights with CheckCircle icons.",
  "frontend/src/components/ContactForm.tsx": "Contact and quote request section with company address/phone/email cards and a React Hook Form-powered form that submits data to the backend actor via a TanStack Query mutation.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with company info, contact details, and quick navigation links that scroll to page sections or navigate to the home page first if needed. Includes a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with logo, desktop nav links, and a mobile hamburger menu supporting smooth scroll-to-section and route navigation for Home, About, Services, Contact, Resources, and Careers.",
  "frontend/src/components/Hero.tsx": "Full-width hero section with a headline, CTA buttons for requesting a quote and learning more, and three feature cards highlighting fleet size, 24/7 service, and nationwide coverage.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper that composes the Header, a TanStack Router Outlet for page content, and the Footer into a full-height page structure.",
  "frontend/src/components/Services.tsx": "Displays a grid of four service cards (OTR, local delivery, team driving, refrigerated transport) followed by a branded stats banner explaining the company's direct-asset value proposition.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) via React Query, and invalidates all non-actor queries whenever the actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useQueries.ts": "Exports three React Query hooks—useGetAllSubmissions, useGetPrivacyPolicy, and useGetResourcesContent—that fetch data from the ICP backend actor when it is available.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for light and dark themes using OKLCH color values, including colors for background, foreground, primary, sidebar, and chart elements.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for data fetching and InternetIdentityProvider for authentication wrapping the root App component.",
  "frontend/src/pages/CareersPage.tsx": "Careers page component displaying a Class A CDL Team Driver OTR job posting with pay structure, mileage guarantee, requirements, and contact info, plus injecting a schema.org JobPosting JSON-LD structured data script into the document head.",
  "frontend/src/pages/HomePage.tsx": "Home page component that composes the Hero, About, Services, and ContactForm sections into a single page layout.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Privacy policy page that fetches and renders policy content from a backend query, showing loading skeletons and error alerts as needed, with a hardcoded SMS Communication Notice appended at the bottom.",
  "frontend/src/pages/ResourcesPage.tsx": "Resources page that fetches and displays content from a backend query, processing a specific placeholder pattern to render an internal anchor link to the contact section.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends border radius and box shadow, adds accordion keyframe animations, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking version, known issues (non-functional Careers nav link, missing JobPosting schema), and a list of previously implemented features with their requirement IDs."
}