{
  "backend/main.mo": "Main Motoko actor for the Supreme Trucking Group backend, defining data types (QuoteRequest, ShipmentRecord, ComplianceDocument, etc.) and storage maps for quotes, shipments, compliance documents, resources, and form submissions, with pre-populated resources content about FSMA 204 compliance.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and key implementation details for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark mode color themes including background, foreground, primary, sidebar, and chart colors.",
  "frontend/index.html": "Root HTML template for the Supreme Trucking Group frontend app, mounting the React app at the #root div and loading the main.tsx entry point.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for home, privacy policy, resources, and careers pages, wrapped in QueryClientProvider and a Toaster notification component.",
  "frontend/src/components/About.tsx": "About Us section component displaying a reefer truck image, company description, and four service offerings with checkmark icons.",
  "frontend/src/components/ContactForm.tsx": "Contact and quote request form component with react-hook-form validation, backend mutation via the actor, success/error toast notifications, and company contact info cards.",
  "frontend/src/components/Footer.tsx": "Footer component with company logo, contact info, quick navigation links (including Privacy Policy, Resources, Careers), dynamic copyright year, and a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with logo, desktop nav links, and a responsive mobile hamburger menu supporting smooth scroll-to-section and route navigation.",
  "frontend/src/components/Hero.tsx": "Full-width hero section with a headline, CTA buttons for quote/about scroll, and three feature cards highlighting fleet size, 24/7 service, and nationwide coverage.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper that renders the Header, a TanStack Router Outlet for page content, and the Footer.",
  "frontend/src/components/Services.tsx": "Services section displaying four trucking service cards (OTR, local, team driving, refrigerated) plus a stats banner promoting direct fleet ownership.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) via React Query, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, login, and logout using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching form submissions, privacy policy, and resources content from the ICP backend actor.",
  "frontend/src/index.css": "Global Tailwind CSS entry point defining light and dark mode CSS custom properties for the design token system (colors, radius, sidebar, charts).",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/CareersPage.tsx": "Renders a Class A CDL Team Driver job posting page for Supreme Trucking, including pay structure, requirements, and contact info, with a schema.org JobPosting JSON-LD script injected into the document head via useEffect.",
  "frontend/src/pages/HomePage.tsx": "Composes the main landing page by rendering the Hero, About, Services, and ContactForm components in sequence.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Fetches and displays the privacy policy content from an API, showing loading skeletons and error alerts as needed, with a hardcoded SMS Communication Notice appended at the bottom.",
  "frontend/src/pages/ResourcesPage.tsx": "Fetches and displays resources content from an API, processing the text to convert a specific bracketed phrase into an internal hyperlink to the contact section.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode support, oklch-based CSS variable color tokens, custom border radius, accordion keyframe animations, and the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project state at version 19, listing existing implemented features (primarily around the CareersPage JobPosting JSON-LD schema) and a known issue about the schema not appearing after a prior deployment."
}