{
  "backend/main.mo": "Main Motoko actor defining all data types (QuoteRequest, ShipmentRecord, ComplianceDocument, etc.), storage maps, and includes a MixinStorage blob-storage mixin. Contains extensive pre-populated resources content about FSMA 204 cold chain compliance.",
  "feature_evidence.json": "Feature evidence report confirming that the JobPosting JSON-LD structured data markup was added to the CareersPage component, with high confidence and linked to test requirement REQ-4.",
  "frontend-file-summaries.txt": "JSON map of all frontend source files to one-sentence summaries, serving as a reference index for the frontend codebase structure and component responsibilities.",
  "frontend/index.css": "Root Tailwind CSS file defining OKLCH-based CSS custom properties for the design system's color tokens in both light and dark modes, including sidebar, chart, and semantic UI colors.",
  "frontend/index.html": "Minimal HTML entry point for the React app, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for home, privacy policy, resources, and careers pages, all wrapped in a QueryClientProvider with a Toaster notification component.",
  "frontend/src/components/About.tsx": "About section component displaying company description, a reefer truck image, and four key service offerings with CheckCircle icons.",
  "frontend/src/components/ContactForm.tsx": "Contact and quote request form component using react-hook-form and TanStack Query mutations to submit form data to the backend actor, with validation, success messaging, and contact info cards.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with company info, contact details, and quick navigation links that scroll to page sections or navigate to routes. Includes a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with logo, desktop nav links, and a mobile hamburger menu. Handles smooth scrolling to sections and routing to Resources and Careers pages.",
  "frontend/src/components/Hero.tsx": "Full-width hero section with a headline, CTA buttons for quote and about, and three feature cards highlighting fleet size, 24/7 service, and nationwide coverage.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with a shared Header and Footer, rendering child routes via TanStack Router's Outlet.",
  "frontend/src/components/Services.tsx": "Displays a grid of four service cards (OTR, local delivery, team driving, refrigerated transport) and a highlighted stats banner promoting direct fleet ownership.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using TanStack Query, switching between anonymous and authenticated actors based on the current Internet Identity. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login, logout, and identity state with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for fetching form submissions, privacy policy, and resources content from the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties (design tokens) for light and dark themes using OKLCH color values, plus smooth scroll behavior.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/CareersPage.tsx": "Careers page component that injects a schema.org JobPosting JSON-LD structured data block for SEO and renders a placeholder message indicating job listings are coming soon.",
  "frontend/src/pages/HomePage.tsx": "Home page component that composes the Hero, About, Services, and ContactForm sections in order.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Privacy policy page that fetches policy content from the backend via a custom query hook, displays loading skeletons and error alerts, and appends a static SMS Communication Notice section.",
  "frontend/src/pages/ResourcesPage.tsx": "Resources page that fetches content from the backend and renders it with whitespace preserved, converting a specific bracketed phrase into a hyperlink to the contact section of the home page.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends border radius and box shadow, adds accordion keyframe animations, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking schema version, existing features, and pending action requests (AR-1 through AR-6) for backend privacy policy content updates and structured data additions."
}