{
  "kind": "build_request",
  "title": "Add JobPosting JSON-LD structured data to CareersPage",
  "projectName": "Supreme Trucking",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "In frontend/src/pages/CareersPage.tsx, inject a valid schema.org JobPosting JSON-LD structured data block directly in the component's JSX return as a <script type='application/ld+json'> tag using dangerouslySetInnerHTML. The JSON-LD must include at minimum: @context (https://schema.org), @type (JobPosting), title (Class A CDL Team Driver – OTR Refrigerated), hiringOrganization (Supreme Trucking / supremeltl.com), jobLocation (nationwide/United States), datePosted, baseSalary reflecting the CPM pay structure, and applicationContact with phone (201) 838-0000 ext. 1 and email recruiting@supremeltl.com. Do not modify any other component, page, backend logic, or styling — only add the <script> tag to CareersPage.tsx.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "i need you to add JobPosting schema to the careers page. change nothing else"
        ]
      },
      "acceptanceCriteria": [
        "The rendered DOM of the /careers route contains a <script type='application/ld+json'> element.",
        "The JSON-LD content parses as valid JSON and includes @context, @type, title, hiringOrganization, jobLocation, and datePosted fields.",
        "@type is exactly 'JobPosting'.",
        "hiringOrganization references Supreme Trucking.",
        "applicationContact email is recruiting@supremeltl.com.",
        "No other component, page, backend file, or stylesheet is modified."
      ]
    }
  ],
  "constraints": [
    "Only frontend/src/pages/CareersPage.tsx may be modified.",
    "Do not alter any existing visible content, layout, or styling on the Careers page.",
    "Do not modify any backend files, other frontend components, or other pages."
  ],
  "nonGoals": [
    "Changing any copy, pay rates, contact info, or visual design on the Careers page.",
    "Adding structured data to any page other than CareersPage.tsx.",
    "Modifying Header.tsx, Footer.tsx, or any other component.",
    "Backend changes of any kind."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}